#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudsbits/audiotube-sandbox/runs/run-vbm4wiMosxfGtxff

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.org: Refreshing...
data.terraform_remote_state.org: Refresh complete after 0s
module.ecr_registry.data.aws_partition.current: Refreshing...
module.ecr_disabled.data.aws_partition.current: Refreshing...
module.ecr.data.aws_partition.current: Refreshing...
module.ecr_disabled.data.aws_caller_identity.current: Refreshing...
module.ecr_registry.data.aws_caller_identity.current: Refreshing...
data.aws_partition.current: Refreshing...
module.ecr.data.aws_caller_identity.current: Refreshing...
module.ecr_registry.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_caller_identity.current: Refreshing...
module.ecr.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr_disabled.data.aws_partition.current: Refresh complete after 0s [id=aws]
data.aws_partition.current: Refresh complete after 0s [id=aws]
module.ecr_disabled.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr_registry.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr.data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
data.aws_caller_identity.current: Refresh complete after 0s [id=257625454150]
module.ecr.data.aws_iam_policy_document.repository[0]: Refreshing...
module.ecr.data.aws_iam_policy_document.repository[0]: Refresh complete after 0s [id=4150700097]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.registry will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "registry" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:ReplicateImage",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::257625454150:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 5
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "cloudsbits-audiotube-sandbox"
    }

  # module.ecr.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "cloudsbits-audiotube-sandbox"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "cloudsbits-audiotube-sandbox"
        }
      + tags_all             = {
          + "Name" = "cloudsbits-audiotube-sandbox"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689507658182200547"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                  + {
                      + Action    = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:sts::257625454150:assumed-role/Org-Admin/aws-go-sdk-1689507658182200547"
                        }
                      + Sid       = "ReadWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "cloudsbits-audiotube-sandbox"
    }

  # module.ecr_registry.aws_ecr_registry_policy.this[0] will be created
  + resource "aws_ecr_registry_policy" "this" {
      + id          = (known after apply)
      + policy      = (known after apply)
      + registry_id = (known after apply)
    }

  # module.ecr_registry.aws_ecr_registry_scanning_configuration.this[0] will be created
  + resource "aws_ecr_registry_scanning_configuration" "this" {
      + id          = (known after apply)
      + registry_id = (known after apply)
      + scan_type   = "ENHANCED"

      + rule {
          + scan_frequency = "CONTINUOUS_SCAN"

          + repository_filter {
              + filter      = "*"
              + filter_type = "WILDCARD"
            }
        }
      + rule {
          + scan_frequency = "SCAN_ON_PUSH"

          + repository_filter {
              + filter      = "*"
              + filter_type = "WILDCARD"
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*